\documentclass[11pt]{amsart}
\usepackage{calc,amssymb,amsthm,amsmath,fullpage    }
%\usepackage{mathtools}
\RequirePackage[dvipsnames,usenames]{xcolor}
\usepackage{hyperref}
\hypersetup{
bookmarks,
bookmarksdepth=3,
bookmarksopen,
bookmarksnumbered,
pdfstartview=FitH,
colorlinks,backref,hyperindex,
linkcolor=Sepia,
anchorcolor=BurntOrange,
citecolor=MidnightBlue,
citecolor=OliveGreen,
filecolor=BlueViolet,
menucolor=Yellow,
urlcolor=OliveGreen
}
\usepackage{alltt}
\usepackage{multicol}
%\usepackage{etex}
\usepackage{xspace}
\usepackage{rotating}
\interfootnotelinepenalty=100000

\usepackage{mabliautoref}
\usepackage{colonequals}
\frenchspacing
\input{kmacros3.sty}
\usepackage{stmaryrd}

\usepackage{verbatim}
\usepackage{enumerate}

\DeclareMathOperator{\HH}{H}

\begin{document}
\title{{TestIdeals} package for \emph{Macaulay2}}
\author{Karl Schwede}
\date{\today}
\address{Department of Mathematics, University of Utah, 155 S 1400 E Room 233, Salt Lake City, UT, 84112}
\email{schwede@math.utah.edu}

\begin{abstract}
  This note describes a \emph{Macaulay2} package for computations in commutative rings prime related to $p^{-e}$-linear and Frobenius maps,
  singularities defined in terms of these maps,  various test ideals and modules, and ideals compatible with a given $p^{-e}$-linear map.
\end{abstract}


\subjclass[2010]{13A35}

\keywords{Macaulay2}

%\thanks{The first named author was supported in part by the NSF FRG Grant DMS \#1265261, NSF CAREER Grant DMS \#1252860 and a Sloan Fellowship.}
%\thanks{The second named author was supported in part by the NSF CAREER Grant DMS \#1252860.}
\maketitle

\section{Introduction}

This paper constructive methods for computing various objects related to commutative rings of prime characteristic $p$.
Such a ring $R$ comes equipped with a built-in endomorphism, namely the Frobenius endomorphism $f:R \rightarrow R$ which is the basis for many constructions and definitions
which affords a handle on many problems which is not otherwise available. Two notable examples of the use of the Frobenius endomorphism are the theory of tight closure {\hfill\large\color{red} [Add references]}\\
and the resulting theory of test ideals. {\hfill\large\color{red} [Add references]}\\

{\large\color{red} [Add history of the package]}

\subsection*{Acknowledgements}

We thank ??? for useful conversations and comments on the development of this package.

\section{Frobenius powers and Frobenius roots}

%%% Throughout  this paper $R$ will denote a polynomial ring over a field $\mathbb{K}$ of prime characteristic $p$.

Let $S$ denote any commutative ring of prime characteristic $p$.

\begin{definition}
For any ideal $I\subseteq S$ and any integer $e\geq I$, we define the \emph{$e$th Frobenius power of $I$} to be the ideal denoted $I^{[p^e]}$ which is
generated by all $p^e$th powers of elements in $I$.
\end{definition}

It is easy to see that, if $I$ is generated by $g_1, \dots, g_\ell$, $I^{[p^e]}$ is generated by $g_1^{p^e}, \dots, g_\ell^{p^e}$.


\begin{definition}
For any ideal $I\subseteq S$ and any integer $e\geq I$, we define the \emph{$e$th Frobenius root of $I$} to be the ideal denoted $I^{[1/p^{e}]}$ which is
the smallest ideal $J$ such that $I\subseteq J^{[p^e]}$, if such ideal exists.
\end{definition}

$e$th Frobenius roots exist in polynomial rings (cf.~\cite[\S 2]{BlickleMustataSmithDiscretenessAndRationalityOfFThresholds}) and in power series rings
(cf.~\cite[\S 5]{KatzmanParameterTestIdealOfCMRings}).


\begin{verbatim}
i2 :      R=ZZ/5[x,y,z]
i3 :      I=ideal(x^6*y*z+x^2*y^12*z^3+x*y*z^18)
                18    2 12 3    6
o3 = ideal(x*y*z   + x y  z  + x y*z)
o3 : Ideal of R
i4 :      frobeniusPower(1/5,I)
                2   3
o4 = ideal (x, y , z )
\end{verbatim}

We can extend the definition of Frobenius powers as follows
\begin{definition}{\hfill\large\color{red} [Add references]}\\
Let  $I\subseteq S$ be an ideal.
\begin{enumerate}
 \item[(a)] If $a$ is a positive integer with base-$p$ expansion  $a=a_0 + a_1 p +  \dots + a_r p^r$, we define
 $I^{[n]}=I^{a_0} \left(I^{a_1}\right)^{[p]} \dots  (I^{a_r})^{[p^r]}$. %\left( I^{a_r}\right)^{[p^r]}$ .
 \item[(b)] If $t$ is a non-negative rational number of the form $t = a/p^e$, we define  $I^{[t]} = (I^{[a]})^{[1/p^e]}.$
 \item[(c)] If $t$ is any non-negative rational number, and $\{a_n/p^{e_n}\}_{n\geq 1}$ is a sequence of rational numbers converging to $t$ from above, we define $I^{[t]}$
 to be the stable value of increasing chain of ideals $\{I^{[a_n/p^{e_n}]}\}_{n\geq 1}$.

\end{enumerate}
\end{definition}


\begin{verbatim}
i5 :      frobeniusPower(1/2, ideal(y^2-x^3))
o5 = ideal 1
o5 : Ideal of R
i6 :      frobeniusPower(5/6, ideal(y^2-x^3))
o6 = ideal (y, x)
o6 : Ideal of R
\end{verbatim}



\section{$p^{-e}$- and $p^{e}$-linear maps}

\begin{definition}%{\hfill\large\color{red} [Add references]}\\
Let  $M$ be an $S$-module and $e$ a non-negative integer.
\begin{enumerate}
 \item[(a)] A $p^{-e}$-linear map $\phi:M \rightarrow M$ is an additive map such that
 $\phi(s^{p^e} m)= s\phi(m)$ for all $s\in S$ and $m\in M$.
 \item[(b)] A $p^{e}$-linear map $\psi:M \rightarrow M$ is an additive map such that
 $\phi(s m)= s^{p^e}\phi(m)$ for all $s\in S$ and $m\in M$.
\end{enumerate}
\end{definition}


The following two examples describe two prototypical
$p^{-e}$- and $p^{e}$-linear maps.
\begin{example}
For any $S$-module $M$, we can construct a new $S$-module $F_*^e M$ with elements $\{ F_*^e m \,|\,m\in M\}$ by defining
$F_*^e m_1 + F_*^e m_2 = F_*^e (m_1 +  m_2)$ for all $m_1, m_2 \in M$ and
$s F_*^e m= F_*^e s^{p^e}$ for all $m\in M$ and $s\in S$.

Consider any $\phi\in \Hom_S(F_*^e M, M)$: if we identify $F_*^e M$ with $M$ we can interpret $\phi$ as a $p^{-e}$-linear map.
\end{example}

\begin{example}
The $e$th Frobenius map $f:S \rightarrow S$  raising elements to their $p^e$th power is clearly $p^{e}$-linear.
Furthermore, any ideal $I\subseteq S$, $f$ induces an $p^{e}$-linear map $\HH_I^k (S) \rightarrow \HH_I^k (S)$.
\end{example}

Let $R$ be a polynomial ring with irrelevant ideal $\mathfrak{m}$ and let $g\in R\setminus \{0\}$.
Let $E=E_R(R/\mathfrak{m})$ denote the injective hull of $R/\mathfrak{m}$.

The Frobenius map on $R$ induces a Frobenius map $S$ and on
$\HH^{\dim R-1}_{\mathfrak{m}} (S)=E_S(S/\mathfrak{m}S)=\Ann_E g$ and the kernel of this map is given by
$\Ann_E (g^{p-1}R)^{[1/p]}$ (cf.~\cite[\S 5]{KatzmanParameterTestIdealOfCMRings}).

\begin{verbatim}
i2 :      R=ZZ/5[x,y,z]
i3 :      g=x^3+y^3+z^3
i4 :      u=g^(5-1)
i5 :      frobeniusPower(1/5,ideal(u))
o5 = ideal (z, y, x)
o5 : Ideal of R

i6 :      R=ZZ/7[x,y,z]
i7 :      g=x^3+y^3+z^3
i8 :      u=g^(7-1)
i9 :      frobeniusPower(1/7,ideal(u))
o9 = ideal 1
\end{verbatim}

Thus we see that the induced $p^{e}$-linear map on $\HH_{(x,y,z)}^{2} \left( \mathbb{K}[x,y,z]/(x^3+y^3+z^3) \right)$ is injective
when the characteristic of $\mathbb{K}$ is $7$ and non-injective when the characteristic is $5$.



\section{$F$-singularities}

\section{Test ideals}

In this section, we explain how to compute parameter test modules, parameter test ideals, test ideals and HSLG-modules\footnote{HSLG-modules can be used to give a scheme structure to the $F$-injective or $F$-pure locus.}.

\subsection{Parameter test modules}

Given an $F$-finite reduced ring $R$, the Frobenius map $R \to R^{1/p^e}$ is dual to $T : \omega_{R^{1/p^e}} \to \omega_R$.  As before in \autoref{}, we can represent $\omega_R \subseteq R$ as an ideal, we can write $R = S/I$, and so we can find a $u \in S^{1/p^e}$ representing the map $\omega_{R^{1/p^e}} \to \omega_R$.

The parameter test submodule is the smallest submodule $M \subseteq \omega_R$ (and hence ideal of $R$ since $M \subseteq R$) that agrees generically with $\omega_R$ and that satisfies
\[
T (M^{1/p^e}) \subseteq M.
\]
From within Macualay2, we can compute this using the {\tt testModule} command as follows.
\begin{verbatim}
i3 : R = ZZ/5[x,y,z]/ideal(x^4+y^4+z^4);
i4 : N = testModule(R);
i5 : N#0
             2             2        2
o5 = ideal (z , y*z, x*z, y , x*y, x )
o5 : Ideal of R
i6 : N#1
o6 = ideal 1
o6 : Ideal of R
\end{verbatim}
The output of {\tt testModule} is a list with three items.  The first entry is the test module, the second is the canonical module (as an ideal) that it lives inside, and the third is the element $u$ described above (not listed here, since it is rather complicated).  Note since this ring is Gorenstein, the canonical module is simply represented as the unit ideal.

Here is another example where the ring is not Gorenstein.  
\begin{verbatim}
i2 : R = ZZ/5[x,y,z]/ideal(y*z, x*z, x*y);
i3 : N = testModule(R);
i4 : N#0
             2   2   2
o4 = ideal (z , y , x )
o4 : Ideal of R
i5 : N#1
o5 = ideal (y - z, x + z)
o5 : Ideal of R
\end{verbatim}


\subsection{Parameter test ideals}

\subsection{Test ideals}

\subsection{HSLG modules}

\section{Ideals compatible with given $p^{-e}$-linear map}

\section{Future plans}

\bibliographystyle{skalpha}
\bibliography{MainBib}



\end{document}
